Revit 2027 API
DimensionSegmentArray.ReverseIterator Method
Retrieve a backward moving iterator to the array.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual DimensionSegmentArrayIterator ReverseIterator()
Public Overridable Function ReverseIterator As DimensionSegmentArrayIterator
public:
virtual DimensionSegmentArrayIterator^ ReverseIterator()
abstract ReverseIterator : unit -> DimensionSegmentArrayIterator
override ReverseIterator : unit -> DimensionSegmentArrayIterator
Return Value
DimensionSegmentArrayIterator
Returns a backward moving iterator to the array.
See Also
Reference
DimensionSegmentArray Class
Autodesk.Revit.DB Namespace